Tekla Open API Reference for Tekla Structures 2025
Grid.GridAttributes.LoadAttributes Method
 Loads the attributes from the attribute file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool LoadAttributes(
	string AttributeFile
)
Public Overrides Function LoadAttributes (
	AttributeFile As String
) As Boolean
Parameters
AttributeFile
Type: System.String
The filename of the attribute file.
Return Value
Type: Boolean
True if the attributes are loaded correctly. False if the attribute file loading failed.
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace